 

 ​const​ asena = require​(​'../events'​)​; 
 ​const​ ​{​MessageType​,​Mimetype​}​ ​=​ ​require​(​'@adiwajshing/baileys'​)​; 
 ​const​ ​translatte​ ​=​ ​require​(​'translatte'​)​; 
 ​const​ ​config​ ​=​ ​require​(​'../config'​)​; 
 ​const​ ​s​ ​=​ ​require​(​'../config'​)​; 
 ​const​ ​LanguageDetect​ ​=​ ​require​(​'languagedetect'​)​; 
 ​const​ ​lngDetector​ ​=​ ​new​ ​LanguageDetect​(​)​; 
 ​const​ ​Heroku​ ​=​ ​require​(​'heroku-client'​)​; 
 ​const​ ​v​ ​=​ ​s​.​SUPPORT3 
 ​let​ ​sourav​ ​=​ ​config​.​WORKTYPE​ ​==​ ​'public'​ ? ​false​ : ​true 
 ​const​ ​heroku​ ​=​ ​new​ ​Heroku​(​{ 
 ​    ​token​: ​config​.​HEROKU​.​API_KEY 
 ​}​)​; 
 ​let​ ​baseURI​ ​=​ ​'/apps/'​ ​+​ ​config​.​HEROKU​.​APP_NAME​; 
 ​//============================== LYRICS ============================================= 
 ​const​ ​axios​ ​=​ ​require​(​'axios'​)​; 
 ​const​ ​{​ requestLyricsFor​,​ requestAuthorFor​,​ requestTitleFor​,​ requestIconFor ​}​ ​=​ ​require​(​"solenolyrics"​)​; 
 ​const​ ​solenolyrics​=​ ​require​(​"solenolyrics"​)​;​  
 ​//============================== CURRENCY ============================================= 
 ​const​ ​{​ exchangeRates ​}​ ​=​ ​require​(​'exchange-rates-api'​)​; 
 ​const​ ​ExchangeRatesError​ ​=​ ​require​(​'exchange-rates-api/src/exchange-rates-error.js'​) 
 ​//============================== TTS ================================================== 
 ​const​ ​fs​ ​=​ ​require​(​'fs'​)​; 
 ​const​ ​https​ ​=​ ​require​(​'https'​)​; 
 ​const​ ​googleTTS​ ​=​ ​require​(​'google-translate-tts'​)​; 
 ​//===================================================================================== 
 ​//============================== YOUTUBE ============================================== 
 ​const​ ​ytdl​ ​=​ ​require​(​'ytdl-core'​)​; 
 ​const​ ​ffmpeg​ ​=​ ​require​(​'fluent-ffmpeg'​)​; 
 ​const​ ​yts​ ​=​ ​require​(​ ​'yt-search'​ ​) 
 ​const​ ​got​ ​=​ ​require​(​"got"​)​; 
 ​const​ ​ID3Writer​ ​=​ ​require​(​'browser-id3-writer'​)​; 
 ​const​ ​SpotifyWebApi​ ​=​ ​require​(​'spotify-web-api-node'​)​; 
  
 ​const​ ​spotifyApi​ ​=​ ​new​ ​SpotifyWebApi​(​{ 
 ​    ​clientId​: ​'acc6302297e040aeb6e4ac1fbdfd62c3'​, 
 ​    ​clientSecret​: ​'0e8439a1280a43aba9a5bc0a16f3f009' 
 ​}​)​; 
 ​//===================================================================================== 
 ​const​ ​Language​ ​=​ ​require​(​'../language'​)​; 
 ​const​ ​Lang​ ​=​ ​Language​.​getString​(​'scrapers'​)​; 
 ​const​ ​Glang​ ​=​ ​Language​.​getString​(​'github'​)​; 
 ​const​ ​Slang​ ​=​ ​Language​.​getString​(​'lyrics'​)​; 
 ​const​ ​Clang​ ​=​ ​Language​.​getString​(​'covid'​)​; 
  
 ​const​ ​wiki​ ​=​ ​require​(​'wikijs'​)​.​default​; 
 ​var​ ​gis​ ​=​ ​require​(​'g-i-s'​)​; 
  
 ​var​ ​dlang_dsc​ ​=​ ​'' 
 ​var​ ​closer_res​ ​=​ ​'' 
 ​var​ ​dlang_lang​ ​=​ ​'' 
 ​var​ ​dlang_similarity​ ​=​ ​'' 
 ​var​ ​dlang_other​ ​=​ ​'' 
 ​var​ ​dlang_input​ ​=​ ​'' 
  
 ​if​ ​(​config​.​LANG​ ​==​ ​'TR'​)​ ​{ 
 ​    ​dlang_dsc​ ​=​ ​'Yanıtlanan mesajın dilini tahmin eder.' 
 ​    ​closer_res​ ​=​ ​'En Yakın Sonuç:' 
 ​    ​dlang_lang​ ​=​ ​'Dil:' 
 ​    ​dlang_similarity​ ​=​ ​'Benzerlik:' 
 ​    ​dlang_other​ ​=​ ​'Diğer Diller' 
 ​    ​dlang_input​ ​=​ ​'İşlenen Metin:' 
 ​} 
 ​if​ ​(​config​.​LANG​ ​==​ ​'EN'​)​ ​{ 
 ​    ​dlang_dsc​ ​=​ ​'Guess the language of the replied message.' 
 ​    ​closer_res​ ​=​ ​'Closest Result:' 
 ​    ​dlang_lang​ ​=​ ​'Language:' 
 ​    ​dlang_similarity​ ​=​ ​'Similarity:' 
 ​    ​dlang_other​ ​=​ ​'Other Languages' 
 ​    ​dlang_input​ ​=​ ​'Processed Text:' 
 ​} 
 ​if​ ​(​config​.​LANG​ ​==​ ​'AZ'​)​ ​{ 
 ​    ​dlang_dsc​ ​=​ ​'Cavablanan mesajın dilini təxmin edin.' 
 ​    ​closer_res​ ​=​ ​'Ən yaxın nəticə:' 
 ​    ​dlang_lang​ ​=​ ​'Dil:' 
 ​    ​dlang_similarity​ ​=​ ​'Bənzərlik:' 
 ​    ​dlang_other​ ​=​ ​'Başqa Dillər' 
 ​    ​dlang_input​ ​=​ ​'İşlənmiş Mətn:' 
 ​} 
 ​if​ ​(​config​.​LANG​ ​==​ ​'ML'​)​ ​{ 
 ​    ​dlang_dsc​ ​=​ ​'മറുപടി നൽകിയ സന്ദേശത്തിന്റെ ഭാഷ ess ഹിക്കുക.' 
 ​    ​closer_res​ ​=​ ​'ഏറ്റവും അടുത്ത ഫലം:' 
 ​    ​dlang_lang​ ​=​ ​'നാവ്:' 
 ​    ​dlang_similarity​ ​=​ ​'സമാനത:' 
 ​    ​dlang_other​ ​=​ ​'മറ്റ് ഭാഷകൾ' 
 ​    ​dlang_input​ ​=​ ​'പ്രോസസ്സ് ചെയ്ത വാചകം:' 
 ​} 
 ​if​ ​(​config​.​LANG​ ​==​ ​'HI'​)​ ​{ 
 ​    ​dlang_dsc​ ​=​ ​'उत्तर दिए गए संदेश की भाषा का अनुमान लगाएं' 
 ​    ​closer_res​ ​=​ ​'निकटतम परिणाम:' 
 ​    ​dlang_lang​ ​=​ ​'जुबान:' 
 ​    ​dlang_similarity​ ​=​ ​'समानता:' 
 ​    ​dlang_other​ ​=​ ​'अन्य भाषाएँ' 
 ​    ​dlang_input​ ​=​ ​'संसाधित पाठ:' 
 ​} 
 ​if​ ​(​config​.​LANG​ ​==​ ​'ES'​)​ ​{ 
 ​    ​dlang_dsc​ ​=​ ​'Adivina el idioma del mensaje respondido.' 
 ​    ​closer_res​ ​=​ ​'Resultado más cercano:' 
 ​    ​dlang_lang​ ​=​ ​'Lengua:' 
 ​    ​dlang_similarity​ ​=​ ​'Semejanza:' 
 ​    ​dlang_other​ ​=​ ​'Otros idiomas:' 
 ​    ​dlang_input​ ​=​ ​'Texto procesado:' 
 ​} 
 ​if​ ​(​config​.​LANG​ ​==​ ​'PT'​)​ ​{ 
 ​    ​dlang_dsc​ ​=​ ​'Adivinhe o idioma da mensagem respondida.' 
 ​    ​closer_res​ ​=​ ​'Resultado mais próximo:' 
 ​    ​dlang_lang​ ​=​ ​'Língua:' 
 ​    ​dlang_similarity​ ​=​ ​'Similaridade:' 
 ​    ​dlang_other​ ​=​ ​'Outras línguas' 
 ​    ​dlang_input​ ​=​ ​'Texto Processado:' 
 ​} 
 ​if​ ​(​config​.​LANG​ ​==​ ​'ID'​)​ ​{ 
 ​    ​dlang_dsc​ ​=​ ​'Tebak bahasa pesan yang dibalas.' 
 ​    ​closer_res​ ​=​ ​'Hasil Terdekat:' 
 ​    ​dlang_lang​ ​=​ ​'Lidah:' 
 ​    ​dlang_similarity​ ​=​ ​'Kesamaan:' 
 ​    ​dlang_other​ ​=​ ​'Bahasa Lainnya' 
 ​    ​dlang_input​ ​=​ ​'Teks yang Diproses:' 
 ​} 
 ​if​ ​(​config​.​LANG​ ​==​ ​'RU'​)​ ​{ 
 ​    ​dlang_dsc​ ​=​ ​'Угадай язык ответного сообщения.' 
 ​    ​closer_res​ ​=​ ​'Ближайший результат:' 
 ​    ​dlang_lang​ ​=​ ​'Язык:' 
 ​    ​dlang_similarity​ ​=​ ​'Сходствo:' 
 ​    ​dlang_other​ ​=​ ​'Другие языки' 
 ​    ​dlang_input​ ​=​ ​'Обработанный текст:' 
 ​} 
  
  
 ​kichu.​addCommand​(​{​pattern​: ​'trt(?: |$)(\\S*) ?(\\S*)'​,​ ​desc​: ​Lang​.​TRANSLATE_DESC​,​ ​usage​: ​Lang​.​TRANSLATE_USAGE​,​ ​fromMe​: ​false}​,​ ​(​async​ ​(​message​,​ ​match​)​ ​=>​ ​{ 
  
 ​        ​if​ ​(​!​message​.​reply_message​)​ ​{ 
 ​            ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​NEED_REPLY​,​MessageType​.​text​)​; 
 ​        ​} 
  
 ​        ​ceviri​ ​=​ ​await​ ​translatte​(​message​.​reply_message​.​message​,​ ​{​from​: ​match​[​1​]​ ​===​ ​''​ ? ​'auto'​ : ​match​[​1​]​,​ ​to​: ​match​[​2​]​ ​===​ ​''​ ? ​config​.​LANG​ : ​match​[​2​]​}​)​; 
 ​        ​if​ ​(​'text'​ ​in​ ​ceviri​)​ ​{ 
 ​            ​await​ ​message​.​reply​(​'*▶️ '​ ​+​ ​Lang​.​LANG​ ​+​ ​':* ```'​ ​+​ ​(​match​[​1​]​ ​===​ ​''​ ? ​'auto'​ : ​match​[​1​]​)​ ​+​ ​'```\n' 
 ​            ​+​ ​'*◀️ '​ ​+​ ​Lang​.​FROM​ ​+​ ​'*: ```'​ ​+​ ​(​match​[​2​]​ ​===​ ​''​ ? ​config​.​LANG​ : ​match​[​2​]​)​ ​+​ ​'```\n' 
 ​            ​+​ ​'*🔎 '​ ​+​ ​Lang​.​RESULT​ ​+​ ​':* ```'​ ​+​ ​'⬇️'​ ​+​ ​'```'​)​; 
 ​        ​return​ ​await​ ​message​.​reply​(​ceviri​.​text​) 
 ​}​ ​else​ ​{ 
 ​            ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​TRANSLATE_ERROR​,​MessageType​.​text​) 
 ​        ​} 
 ​    ​}​)​)​; 
 ​    ​kichu.​addCommand​(​{​pattern​: ​'detectlang$'​,​ ​fromMe​: ​false,​ ​desc​: ​dlang_dsc​}​,​ ​(​async​ ​(​message​,​ ​match​)​ ​=>​ ​{ 
  
 ​        ​if​ ​(​!​message​.​reply_message​)​ ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​NEED_REPLY​,​ ​MessageType​.​text​) 
 ​        ​const​ ​msg​ ​=​ ​message​.​reply_message​.​text 
 ​        ​var​ ​ldet​ ​=​ ​lngDetector​.​detect​(​msg​) 
 ​        ​async​ ​function​ ​upperfirstLetter​(​letter​)​ ​{ 
 ​            ​return​ ​letter​.​charAt​(​0​)​.​toUpperCase​(​)​ ​+​ ​letter​.​slice​(​1​)​.​toLowerCase​(​)​; 
 ​        ​} 
 ​        ​var​ ​cls1​ ​=​ ​await​ ​upperfirstLetter​(​ldet​[​0​]​[​0​]​) 
 ​        ​var​ ​cls2​ ​=​ ​ldet​[​0​]​[​1​]​.​toString​(​) 
 ​        ​var​ ​cls3​ ​=​ ​await​ ​upperfirstLetter​(​ldet​[​1​]​[​0​]​) 
 ​        ​var​ ​cls4​ ​=​ ​ldet​[​1​]​[​1​]​.​toString​(​) 
 ​        ​var​ ​cls5​ ​=​ ​await​ ​upperfirstLetter​(​ldet​[​2​]​[​0​]​) 
 ​        ​var​ ​cls6​ ​=​ ​ldet​[​2​]​[​1​]​.​toString​(​) 
 ​        ​var​ ​cls7​ ​=​ ​await​ ​upperfirstLetter​(​ldet​[​3​]​[​0​]​) 
 ​        ​var​ ​cls8​ ​=​ ​ldet​[​3​]​[​1​]​.​toString​(​) 
 ​        ​const​ ​res_1​ ​=​ ​'*'​ ​+​ ​dlang_input​ ​+​ ​'* '​ ​+​ ​'_'​ ​+​ ​msg​ ​+​ ​'_ \n' 
 ​        ​const​ ​res_2​ ​=​ ​'*'​ ​+​ ​closer_res​ ​+​ ​'* '​ ​+​ ​'_'​ ​+​ ​cls1​ ​+​ ​'_\n*'​ ​+​ ​dlang_similarity​ ​+​ ​'* '​ ​+​ ​'_'​ ​+​ ​cls2​ ​+​ ​'_ \n\n' 
 ​        ​const​ ​res_3​ ​=​ ​'```[ '​ ​+​ ​dlang_other​ ​+​ ​' ]```\n\n' 
 ​        ​const​ ​res_4​ ​=​ ​'#2 *'​ ​+​ ​dlang_lang​ ​+​ ​'* '​ ​+​ ​'_'​ ​+​ ​cls3​ ​+​ ​'_\n*'​ ​+​ ​dlang_similarity​ ​+​ ​'* '​ ​+​ ​'_'​ ​+​ ​cls4​ ​+​ ​'_ \n' 
 ​        ​const​ ​res_5​ ​=​ ​'#3 *'​ ​+​ ​dlang_lang​ ​+​ ​'* '​ ​+​ ​'_'​ ​+​ ​cls5​ ​+​ ​'_\n*'​ ​+​ ​dlang_similarity​ ​+​ ​'* '​ ​+​ ​'_'​ ​+​ ​cls6​ ​+​ ​'_ \n' 
 ​        ​const​ ​res_6​ ​=​ ​'#4 *'​ ​+​ ​dlang_lang​ ​+​ ​'* '​ ​+​ ​'_'​ ​+​ ​cls7​ ​+​ ​'_\n*'​ ​+​ ​dlang_similarity​ ​+​ ​'* '​ ​+​ ​'_'​ ​+​ ​cls8​ ​+​ ​'_' 
 ​        ​const​ ​rep_7​ ​=​ ​res_1​ ​+​ ​res_2​ ​+​ ​res_3​ ​+​ ​res_4​ ​+​ ​res_5​ ​+​ ​res_6 
 ​        ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​rep_7​,​MessageType​.​text​,​ ​{​ ​quoted​: ​message​.​data​ ​}​)​; 
 ​    ​}​)​)​; 
 ​    ​kichu.​addCommand​(​{​pattern​: ​'currency(?: ([0-9.]+) ([a-zA-Z]+) ([a-zA-Z]+)|$|(.*))'​,​ ​fromMe​: ​true​}​,​ ​(​async​ ​(​message​,​ ​match​)​ ​=>​ ​{ 
  
 ​        ​if​(​match​[​1​]​ ​===​ ​undefined​ ​||​ ​match​[​2​]​ ​==​ ​undefined​ ​||​ ​match​[​3​]​ ​==​ ​undefined​)​ ​{ 
 ​            ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​CURRENCY_ERROR​,​MessageType​.​text​)​; 
 ​        ​} 
 ​        ​let​ ​opts​ ​=​ ​{ 
 ​            ​amount​: ​parseFloat​(​match​[​1​]​)​.​toFixed​(​2​)​.​replace​(​/​\.​0​+​$​/​,​''​)​, 
 ​            ​from​: ​match​[​2​]​.​toUpperCase​(​)​, 
 ​            ​to​: ​match​[​3​]​.​toUpperCase​(​) 
 ​        ​} 
 ​        ​try​ ​{ 
 ​            ​result​ ​=​ ​await​ ​exchangeRates​(​)​.​latest​(​)​.​symbols​(​[​opts​.​to​]​)​.​base​(​opts​.​from​)​.​fetch​(​) 
 ​            ​result​ ​=​ ​parseFloat​(​result​)​.​toFixed​(​2​)​.​replace​(​/​\.​0​+​$​/​,​''​) 
 ​            ​await​ ​message​.​reply​(​`\`\`\`​${​opts​.​amount​}​ ​${​opts​.​from​}​ = ​${​result​}​ ​${​opts​.​to​}​\`\`\``​) 
 ​        ​} 
 ​        ​catch​(​err​)​ ​{ 
 ​            ​if​ ​(​err​ ​instanceof​ ​ExchangeRatesError​)​  
 ​                ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​INVALID_CURRENCY​,​MessageType​.​text​) 
 ​            ​else​ ​{ 
 ​                ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​UNKNOWN_ERROR​,​MessageType​.​text​) 
 ​                ​console​.​log​(​err​) 
 ​            ​} 
 ​        ​} 
 ​    ​}​)​)​; 
  
 ​     
 ​    ​kichu​.​addCommand​(​{​pattern​: ​'tts (.*)'​,​ ​fromMe​: ​false,​ ​desc​: ​Lang​.​TTS_DESC​}​,​ ​(​async​ ​(​message​,​ ​match​)​ ​=>​ ​{ 
  
 ​        ​if​(​!​match​[​1​]​)​ ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​ ​"_Give me any parameters!_"​,​ ​MessageType​.​text​,​ ​{​quoted​: ​message​.​data​}​)​; 
 ​        ​var​ ​text​ ​=​ ​!​message​.​reply_message​ ? ​match​[​1​]​ : ​message​.​reply_message​.​message 
 ​        ​let​  
 ​            ​LANG​ ​=​ ​config​.​LANG​.​toLowerCase​(​)​, 
 ​            ​ttsMessage​ ​=​ ​text​, 
 ​            ​SPEED​ ​=​ ​1.0 
  
 ​        ​if​(​langMatch​ ​=​ ​text​.​match​(​"\\{([a-z]{2})\\}"​)​)​ ​{ 
 ​            ​LANG​ ​=​ ​langMatch​[​1​] 
 ​            ​ttsMessage​ ​=​ ​ttsMessage​.​replace​(​langMatch​[​0​]​,​ ​""​) 
 ​        ​}​  
 ​        ​if​(​speedMatch​ ​=​ ​text​.​match​(​"\\{([0].[0-9]+)\\}"​)​)​ ​{ 
 ​            ​SPEED​ ​=​ ​parseFloat​(​speedMatch​[​1​]​) 
 ​            ​ttsMessage​ ​=​ ​ttsMessage​.​replace​(​speedMatch​[​0​]​,​ ​""​) 
 ​        ​} 
 ​     
 ​        ​var​ ​buffer​ ​=​ ​await​ ​googleTTS​.​synthesize​(​{ 
 ​            ​text​: ​ttsMessage​, 
 ​            ​voice​: ​LANG 
 ​        ​}​)​; 
 ​        ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​buffer​,​ ​MessageType​.​audio​,​ ​{​mimetype​: ​Mimetype​.​mp4Audio​,​quoted​: ​message​.​data​,​  ​ptt​: ​true​}​)​; 
 ​    ​}​)​)​; 
 ​const​ ​_0x2c4d33​=​_0x5924​;​function​ ​_0x2be7​(​)​{​const​ ​_0x249870​=​[​'SONGU'​,​'10352952hIjQpQ'​,​'Text\x201\x20here'​,​'thumbnail'​,​'6902814btCCIp'​,​'image'​,​'setFrame'​,​'BOTSK'​,​'title'​,​'from'​,​'readFileSync'​,​'arrayBuffer'​,​'6432433zufDVl'​,​'data'​,​'1964vHEFzR'​,​'createWriteStream'​,​'videoId'​,​'2406924efIbKZ'​,​'sendMessage'​,​'song\x20?(.*)'​,​'all'​,​'SONGD'​,​'.mp3'​,​'.jpg'​,​'addCommand'​,​'NO_RESULT'​,​'audioBitrate'​,​'TPE1'​,​'TIT2'​,​'SONG_DESC'​,​'APIC'​,​'659181gudcmZ'​,​'end'​,​'stream'​,​'1549630ISQcdy'​,​'url'​,​'client'​,​'10XYBNtG'​,​'audio'​,​'pipe'​,​'Downloaded\x20by\x20'​,​'text'​,​'jid'​,​'length'​,​'author'​,​'mp4Audio'​]​;​_0x2be7​=​function​(​)​{​return​ ​_0x249870​;​}​;​return​ ​_0x2be7​(​)​;​}​function​ ​_0x5924​(​_0x47af37​,​_0xdb4b6f​)​{​const​ ​_0x2be77e​=​_0x2be7​(​)​;​return​ ​_0x5924​=​function​(​_0x5924a9​,​_0x28db75​)​{​_0x5924a9​=​_0x5924a9​-​0xae​;​let​ ​_0x1363f9​=​_0x2be77e​[​_0x5924a9​]​;​return​ ​_0x1363f9​;​}​,​_0x5924​(​_0x47af37​,​_0xdb4b6f​)​;​}​(​function​(​_0x5dc1e2​,​_0x53fc79​)​{​const​ ​_0x4d263b​=​_0x5924​,​_0x1cf43a​=​_0x5dc1e2​(​)​;​while​(​!​!​[​]​)​{​try​{​const​ ​_0x17da86​=​-​parseInt​(​_0x4d263b​(​0xcc​)​)​/​0x1​+​-​parseInt​(​_0x4d263b​(​0xb5​)​)​/​0x2​*​(​parseInt​(​_0x4d263b​(​0xaf​)​)​/​0x3​)​+​parseInt​(​_0x4d263b​(​0xcf​)​)​/​0x4​+​parseInt​(​_0x4d263b​(​0xb2​)​)​/​0x5​+​parseInt​(​_0x4d263b​(​0xc2​)​)​/​0x6​+​parseInt​(​_0x4d263b​(​0xca​)​)​/​0x7​+​-​parseInt​(​_0x4d263b​(​0xbf​)​)​/​0x8​;​if​(​_0x17da86​===​_0x53fc79​)​break​;​else​ ​_0x1cf43a​[​'push'​]​(​_0x1cf43a​[​'shift'​]​(​)​)​;​}​catch​(​_0x1ebcd0​)​{​_0x1cf43a​[​'push'​]​(​_0x1cf43a​[​'shift'​]​(​)​)​;​}​}​}​(​_0x2be7​,​0x8f257​)​,​skl​[​_0x2c4d33​(​0xd6​)​]​(​{​'pattern'​:​_0x2c4d33​(​0xd1​)​,​'fromMe'​:​sourav​,​'desc'​:​Lang​[​_0x2c4d33​(​0xdb​)​]​}​,​async​(​_0xe80f0c​,​_0x234020​)​=>​{​const​ ​_0x25f169​=​_0x2c4d33​;​if​(​_0x234020​[​0x1​]​===​''​)​return​ ​await​ ​_0xe80f0c​[​'client'​]​[​_0x25f169​(​0xd0​)​]​(​_0xe80f0c​[​_0x25f169​(​0xba​)​]​,​Lang​[​'NEED_TEXT_SONG'​]​,​MessageType​[​_0x25f169​(​0xb9​)​]​)​;​let​ ​_0x3feaf1​=​await​ ​yts​(​_0x234020​[​0x1​]​)​;​_0x3feaf1​=​_0x3feaf1​[​_0x25f169​(​0xd2​)​]​;​if​(​_0x3feaf1​[​_0x25f169​(​0xbb​)​]​<​0x1​)​return​ ​await​ ​_0xe80f0c​[​_0x25f169​(​0xb4​)​]​[​_0x25f169​(​0xd0​)​]​(​_0xe80f0c​[​'jid'​]​,​Lang​[​_0x25f169​(​0xd7​)​]​,​MessageType​[​'text'​]​)​;​var​ ​_0x40d7ed​=​await​ ​_0xe80f0c​[​_0x25f169​(​0xb4​)​]​[​'sendMessage'​]​(​_0xe80f0c​[​_0x25f169​(​0xba​)​]​,​config​[​_0x25f169​(​0xd3​)​]​,​MessageType​[​'text'​]​)​;​let​ ​_0x3c55f3​=​_0x3feaf1​[​0x0​]​[​_0x25f169​(​0xc6​)​]​[​'replace'​]​(​'\x20'​,​'+'​)​,​_0x4c0bc2​=​ytdl​(​_0x3feaf1​[​0x0​]​[​_0x25f169​(​0xce​)​]​,​{​'quality'​:​'highestaudio'​}​)​;​got​[​_0x25f169​(​0xb1​)​]​(​_0x3feaf1​[​0x0​]​[​_0x25f169​(​0xc3​)​]​)​[​_0x25f169​(​0xb7​)​]​(​fs​[​_0x25f169​(​0xcd​)​]​(​_0x3c55f3​+​'.jpg'​)​)​,​ffmpeg​(​_0x4c0bc2​)​[​_0x25f169​(​0xd8​)​]​(​0x140​)​[​'save'​]​(​'./'​+​_0x3c55f3​+​'.mp3'​)​[​'on'​]​(​_0x25f169​(​0xb0​)​,​async​(​)​=>​{​const​ ​_0x32a46a​=​_0x25f169​,​_0x191d85​=​new​ ​ID3Writer​(​fs​[​_0x32a46a​(​0xc8​)​]​(​'./'​+​_0x3c55f3​+​_0x32a46a​(​0xd4​)​)​)​;​_0x191d85​[​'setFrame'​]​(​_0x32a46a​(​0xda​)​,​_0x3feaf1​[​0x0​]​[​_0x32a46a​(​0xc6​)​]​)​[​_0x32a46a​(​0xc4​)​]​(​_0x32a46a​(​0xd9​)​,​[​_0x3feaf1​[​0x0​]​[​_0x32a46a​(​0xbc​)​]​[​'name'​]​]​)​[​'setFrame'​]​(​_0x32a46a​(​0xae​)​,​{​'type'​:​0x3​,​'data'​:​fs​[​_0x32a46a​(​0xc8​)​]​(​_0x3c55f3​+​_0x32a46a​(​0xd5​)​)​,​'description'​:​_0x3feaf1​[​0x0​]​[​'description'​]​}​)​,​_0x191d85​[​'addTag'​]​(​)​,​_0x40d7ed​=​await​ ​_0xe80f0c​[​'client'​]​[​_0x32a46a​(​0xd0​)​]​(​_0xe80f0c​[​_0x32a46a​(​0xba​)​]​,​config​[​_0x32a46a​(​0xbe​)​]​,​MessageType​[​_0x32a46a​(​0xb9​)​]​)​,​await​ ​_0xe80f0c​[​_0x32a46a​(​0xb4​)​]​[​'sendMessage'​]​(​_0xe80f0c​[​'jid'​]​,​Buffer​[​_0x32a46a​(​0xc7​)​]​(​_0x191d85​[​_0x32a46a​(​0xc9​)​]​)​,​MessageType​[​_0x32a46a​(​0xb6​)​]​,​{​'mimetype'​:​Mimetype​[​_0x32a46a​(​0xbd​)​]​,​'ptt'​:​!​[​]​,​'quoted'​:​_0xe80f0c​[​_0x32a46a​(​0xcb​)​]​,​'contextInfo'​:​{​'forwardingScore'​:​0x64​,​'isForwarded'​:​!​!​[​]​,​'text'​:​_0x32a46a​(​0xc0​)​,​'sendEphemeral'​:​!​!​[​]​,​'externalAdReply'​:​{​'title'​:​_0x3feaf1​[​0x0​]​[​'title'​]​,​'body'​:​_0x32a46a​(​0xb8​)​+​config​[​_0x32a46a​(​0xc5​)​]​,​'mediaType'​:​'2'​,​'thumbnail'​:​await​ ​skbuffer​(​_0x3feaf1​[​0x0​]​[​_0x32a46a​(​0xc1​)​]​)​,​'mediaUrl'​:​_0x3feaf1​[​0x0​]​[​_0x32a46a​(​0xb3​)​]​}​}​}​)​;​}​)​;​}​)​)​; 
 ​kichu.​addCommand​(​{​pattern​: ​'video ?(.*)'​,​ ​fromMe​: ​false​,​ ​desc​: ​Lang​.​VIDEO_DESC​}​,​ ​(​async​ ​(​message​,​ ​match​)​ ​=>​ ​{​  
 ​         ​var​ ​s1​ ​=​ ​!​message​.​reply_message​.​message​ ? ​match​[​1​]​ : ​message​.​reply_message​.​message 
 ​        ​if​ ​(​!​s1​)​ ​return​ ​await​ ​message​.​sendMessage​(​'𝑰𝒏𝒗𝒂𝒍𝒊𝒅 𝑳𝒊𝒏𝒌, 𝑷𝒍𝒆𝒂𝒔𝒆 𝑮𝒊𝒗𝒆 𝒀𝒐𝒖𝒕𝒖𝒃𝒆 𝑽𝒊𝒅𝒆𝒐 𝑳𝒊𝒏𝒌 𝒕𝒐 𝑫𝒐𝒘𝒏𝒍𝒐𝒂𝒅. 𝑶𝒕𝒉𝒆𝒓 𝑳𝒊𝒏𝒌, 𝑼𝒔𝒆 𝑶𝒕𝒉𝒆𝒓 𝑪𝒐𝒎𝒎𝒂𝒏𝒅'​)​; 
 ​        ​if​ ​(​!​s1​.​includes​(​'youtu'​)​)​ ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​NO_RESULT​,​MessageType​.​text​)​; 
 ​       
 ​            ​const​ ​getID​ ​= 
 ​        ​/​(?:​http​(?:​s​|​)​:​\/​\/​|​)​(?:​(?:​www​\.​|​)​youtube​(?:​\-​nocookie​|​)​\.​com​\/​(?:​watch​\?​.​*​(?:​|​\&​)​v=​|​embed​|​shorts​\/​|​v​\/​)​|​youtu​\.​be​\/​)​(​[​-_0-9A-Za-z​]​{​11​}​)​/ 
 ​        ​var​ ​qq​ ​=​ ​getID​.​exec​(​s1​) 
 ​        ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​DOWNLOADING_VIDEO​,​MessageType​.​text​,​ ​{​quoted​ : ​{​ ​key​: ​{​fromMe​: ​true​,​participant​: ​"0@s.whatsapp.net"​,​remoteJid​: ​"status@broadcast"​}​,​message​: ​{​"extendedTextMessage"​: ​{​"text"​: ​config​.​BOTSK​ ​}​}​}​}​)​; 
 ​     ​try​ ​{​ ​var​ ​dl​ ​=​ ​await​ ​getVideo​(​qq​[​1​]​,​v​)​ ​}​ ​catch​ ​{​return​ ​await​ ​message​.​sendMessage​(​"*𝑫𝒐𝒘𝒏𝒍𝒐𝒂𝒅𝒊𝒏𝒈 𝑭𝒂𝒊𝒍𝒆𝒅, 𝑪𝒐𝒏𝒕𝒂𝒄𝒕 𝑶𝒓 𝑴𝒆𝒏𝒕𝒊𝒐𝒏 𝑶𝒘𝒏𝒆𝒓"​)​} 
 ​var​ ​cap​ ​=​ ​dl​.​details​.​title​ ? ​dl​.​details​.​title​ : ​s​.​AFN 
 ​var​ ​th​ ​=​ ​dl​.​details​.​title​ ? ​dl​.​details​.​thumbnail​.​url​ : ​null 
 ​try​ ​{​ ​var​ ​yt​ ​=​ ​ytdl​(​qq​[​1​]​,​ ​{​filter​: ​format​ ​=>​ ​format​.​container​ ​===​ ​'mp4'​ ​&&​ ​[​'720p'​,​ ​'480p'​,​ ​'360p'​,​ ​'240p'​,​ ​'144p'​]​.​map​(​(​)​ ​=>​ ​true​)​}​)​;​ ​}​ ​catch​ ​{​return​ ​await​ ​message​.​sendMessage​(​"*Download failed. Restart bot*"​)​} 
 ​        ​yt​.​pipe​(​fs​.​createWriteStream​(​'./'​ ​+​ ​qq​[​1​]​ ​+​ ​'.mp4'​)​)​; 
 ​        ​yt​.​on​(​'end'​,​ ​async​ ​(​)​ ​=>​ ​{ 
 ​            ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​UPLOADING_VIDEO​,​MessageType​.​text​)​; 
 ​            ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​fs​.​readFileSync​(​'./'​ ​+​ ​qq​[​1​]​ ​+​ ​'.mp4'​)​,​ ​MessageType​.​video​,​ ​{​mimetype​: ​Mimetype​.​mp4​ ​,​ ​caption​:​cap​,​ ​thumbnail​: ​await​ ​skbuffer​(​th​)​}​)​; 
 ​        ​}​)​; 
 ​     
 ​}​)​)​; 
 ​   ​kichu.​addCommand​(​{​pattern​: ​'sing ?(.*)'​,​ ​fromMe​: ​false,​ ​desc​: ​Lang​.​SING_DESC​}​,​ ​(​async​ ​(​message​,​ ​match​)​ ​=>​ ​{​  
  
 ​        ​if​ ​(​match​[​1​]​ ​===​ ​''​)​ ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​NEED_TEXT_SING​,​MessageType​.​text​)​;​     
 ​        ​let​ ​arama​ ​=​ ​await​ ​yts​(​match​[​1​]​)​; 
 ​        ​arama​ ​=​ ​arama​.​all​; 
 ​        ​if​(​arama​.​length​ ​<​ ​1​)​ ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​NO_RESULT​,​MessageType​.​text​)​; 
  
 ​        ​let​ ​title​ ​=​ ​arama​[​0​]​.​title​.​replace​(​' '​,​ ​'+'​)​; 
 ​        ​let​ ​stream​ ​=​ ​ytdl​(​arama​[​0​]​.​videoId​,​ ​{ 
 ​            ​quality​: ​'highestaudio'​, 
 ​        ​}​)​; 
 ​     
 ​        ​got​.​stream​(​arama​[​0​]​.​image​)​.​pipe​(​fs​.​createWriteStream​(​title​ ​+​ ​'.jpg'​)​)​; 
 ​        ​ffmpeg​(​stream​) 
 ​            ​.​audioBitrate​(​320​) 
 ​            ​.​save​(​'./'​ ​+​ ​title​ ​+​ ​'.mp3'​) 
 ​            ​.​on​(​'end'​,​ ​async​ ​(​)​ ​=>​ ​{ 
 ​                ​const​ ​writer​ ​=​ ​new​ ​ID3Writer​(​fs​.​readFileSync​(​'./'​ ​+​ ​title​ ​+​ ​'.mp3'​)​)​; 
 ​                ​writer​.​setFrame​(​'TIT2'​,​ ​arama​[​0​]​.​title​) 
 ​                    ​.​setFrame​(​'TPE1'​,​ ​[​arama​[​0​]​.​author​.​name​]​) 
 ​                    ​.​setFrame​(​'APIC'​,​ ​{ 
 ​                        ​type​: ​3​, 
 ​                        ​data​: ​fs​.​readFileSync​(​title​ ​+​ ​'.jpg'​)​, 
 ​                        ​description​: ​arama​[​0​]​.​description 
 ​                    ​}​)​; 
 ​                ​writer​.​addTag​(​)​; 
  
 ​                 
 ​                ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Buffer​.​from​(​writer​.​arrayBuffer​)​,​ ​MessageType​.​audio​,​ ​{​mimetype​: ​Mimetype​.​mp4Audio​,​ ​ptt​: ​true​,​ ​quoted​: ​{​ ​key​: ​{​ ​fromMe​: ​sourav​,​ ​participant​: ​`0@s.whatsapp.net`​,​ ...​(​message​.​jid​ ? ​{​ ​remoteJid​: ​"status@broadcast"​ ​}​ : ​{​}​)​ ​}​,​ ​message​: ​{​ ​"imageMessage"​: ​{​ ​"url"​: ​"https://mmg.whatsapp.net/d/f/At0x7ZdIvuicfjlf9oWS6A3AR9XPh0P-hZIVPLsI70nM.enc"​,​ ​"mimetype"​: ​"image/jpeg"​,​ ​"caption"​: ​'◄━━━━━━━⦁⦁'​ ​+​ ​config​.​BOTSK​ ​+​ ​'... ⦁⦁━━━━━━━━►'​,​ ​"fileSha256"​: ​"+Ia+Dwib70Y1CWRMAP9QLJKjIJt54fKycOfB2OEZbTU="​,​ ​"fileLength"​: ​"28777"​,​ ​"height"​: ​1080​,​ ​"width"​: ​1079​,​ ​"mediaKey"​: ​"vXmRR7ZUeDWjXy5iQk17TrowBzuwRya0errAFnXxbGc="​,​ ​"fileEncSha256"​: ​"sR9D2RS5JSifw49HeBADguI23fWDz1aZu4faWG/CyRY="​,​ ​"directPath"​: ​"/v/t62.7118-24/21427642_840952686474581_572788076332761430_n.enc?oh=3f57c1ba2fcab95f2c0bb475d72720ba&oe=602F3D69"​,​ ​"mediaKeyTimestamp"​: ​"1610993486"​}​}​}​}​)​; 
 ​            ​}​)​; 
 ​    ​}​)​)​; 
  
 ​     
 ​     
 ​    ​kichu​.​addCommand​(​{​pattern​: ​'isong ?(.*)'​,​ ​fromMe​: ​false​,​ ​desc​: ​Lang​.​ISONG_DESC​}​,​ ​(​async​ ​(​message​,​ ​match​)​ ​=>​ ​{​  
  
 ​        ​if​ ​(​match​[​1​]​ ​===​ ​''​)​ ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​NEED_TEXT_SONG​,​MessageType​.​text​)​;​     
 ​        ​let​ ​arama​ ​=​ ​await​ ​yts​(​match​[​1​]​)​; 
 ​        ​arama​ ​=​ ​arama​.​all​; 
 ​        ​if​(​arama​.​length​ ​<​ ​1​)​ ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​NO_RESULT​,​MessageType​.​text​)​; 
  
 ​        ​let​ ​title​ ​=​ ​arama​[​0​]​.​title​.​replace​(​' '​,​ ​'+'​)​; 
 ​        ​let​ ​stream​ ​=​ ​ytdl​(​arama​[​0​]​.​videoId​,​ ​{ 
 ​            ​quality​: ​'highestaudio'​, 
 ​        ​}​)​; 
 ​     
 ​        ​got​.​stream​(​arama​[​0​]​.​image​)​.​pipe​(​fs​.​createWriteStream​(​title​ ​+​ ​'.jpg'​)​)​; 
 ​        ​ffmpeg​(​stream​) 
 ​            ​.​audioBitrate​(​320​) 
 ​            ​.​save​(​'./'​ ​+​ ​title​ ​+​ ​'.mp3'​) 
 ​            ​.​on​(​'end'​,​ ​async​ ​(​)​ ​=>​ ​{ 
 ​                ​const​ ​writer​ ​=​ ​new​ ​ID3Writer​(​fs​.​readFileSync​(​'./'​ ​+​ ​title​ ​+​ ​'.mp3'​)​)​; 
 ​                ​writer​.​setFrame​(​'TIT2'​,​ ​arama​[​0​]​.​title​) 
 ​                    ​.​setFrame​(​'TPE1'​,​ ​[​arama​[​0​]​.​author​.​name​]​) 
 ​                    ​.​setFrame​(​'APIC'​,​ ​{ 
 ​                        ​type​: ​3​, 
 ​                        ​data​: ​fs​.​readFileSync​(​title​ ​+​ ​'.jpg'​)​, 
 ​                        ​description​: ​arama​[​0​]​.​description 
 ​                    ​}​)​; 
 ​                ​writer​.​addTag​(​)​; 
  
 ​                 
 ​                ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Buffer​.​from​(​writer​.​arrayBuffer​)​,​ ​MessageType​.​document​,​ ​{​filename​: ​config​.​AFN​ ​+​ ​'.mp3'​,​ ​mimetype​: ​'audio/mpeg'​,​ ​quoted​: ​message​.​data​}​)​; 
 ​            ​}​)​; 
 ​    ​}​)​)​; 
  
  
 ​    ​kichu​.​addCommand​(​{​pattern​: ​'wiki ?(.*)'​,​ ​fromMe​: ​false​,​ ​desc​: ​Lang​.​WIKI_DESC​}​,​ ​(​async​ ​(​message​,​ ​match​)​ ​=>​ ​{​  
  
 ​        ​if​ ​(​match​[​1​]​ ​===​ ​''​)​ ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​NEED_WORDS​,​MessageType​.​text​)​;​     
 ​        ​var​ ​reply​ ​=​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​SEARCHING​,​MessageType​.​text​)​; 
  
 ​        ​var​ ​arama​ ​=​ ​await​ ​wiki​(​{​ ​apiUrl​: ​'https://'​ ​+​ ​config​.​LANG​ ​+​ ​'.wikipedia.org/w/api.php'​ ​}​) 
 ​            ​.​page​(​match​[​1​]​)​; 
  
 ​        ​var​ ​info​ ​=​ ​await​ ​arama​.​rawContent​(​)​; 
 ​        ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​ ​info​,​ ​MessageType​.​text​)​; 
 ​        ​await​ ​reply​.​delete​(​)​; 
 ​    ​}​)​)​; 
  
 ​    ​kichu​.​addCommand​(​{​pattern​: ​'img ?(.*)'​,​ ​fromMe​: ​false​,​ ​desc​: ​Lang​.​IMG_DESC​}​,​ ​(​async​ ​(​message​,​ ​match​)​ ​=>​ ​{​  
  
 ​        ​if​ ​(​match​[​1​]​ ​===​ ​''​)​ ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​Lang​.​NEED_WORDS​,​MessageType​.​text​)​; 
 ​        ​gis​(​match​[​1​]​,​ ​async​ ​(​error​,​ ​result​)​ ​=>​ ​{ 
 ​            ​for​ ​(​var​ ​i​ ​=​ ​0​;​ ​i​ ​<​ ​(​result​.​length​ ​<​ ​5​ ? ​result​.​length​ : ​5​)​;​ ​i​++​)​ ​{ 
 ​                ​var​ ​get​ ​=​ ​got​(​result​[​i​]​.​url​,​ ​{​https​: ​{​rejectUnauthorized​: ​false​}​}​)​; 
 ​                ​var​ ​stream​ ​=​ ​get​.​buffer​(​)​; 
 ​                 
 ​                ​stream​.​then​(​async​ ​(​image​)​ ​=>​ ​{ 
 ​                    ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​image​,​ ​MessageType​.​image​,​{​mimetype​: ​Mimetype​.​jpg​,​ ​thumbnail​: ​null​}​)​; 
 ​                ​}​)​; 
 ​            ​} 
  
 ​            ​message​.​reply​(​Lang​.​IMG​.​format​(​(​result​.​length​ ​<​ ​5​ ? ​result​.​length​ : ​5​)​,​ ​match​[​1​]​)​)​; 
 ​        ​}​)​; 
 ​    ​}​)​)​; 
 ​     
 ​kichu.​addCommand​(​{​pattern​: ​'github ?(.*)'​,​ ​fromMe​: ​false,​ ​desc​: ​Glang​.​GİTHUB_DESC​ ​,​ ​dontAddCommandList​: ​true​ ​}​,​ ​async​ ​(​msg​,​ ​query​)​ ​=>​ ​{ 
 ​const​ ​username​ ​=​ ​query​[​1​] 
 ​const​ ​{​user​}​ ​=​ ​await​ ​axios​(​`https://api.github.com/users/​${​username​}​`​) 
 ​const​ ​{​ login​,​ avatar_url​,​ html_url​,​ followers​,​ following​,​ bio​,​ name​,​ type​,​ location​,​ blog​,​ pulic_repos​,​ public_gists​,​ created_at​,​ updated_at​,​ id​,​ company ​}​ ​=​ ​user 
 ​if​ ​(​!​username​)​ ​{​  
 ​        ​return​ ​await​ ​msg​.​client​.​sendMessage​(​msg​.​jid​,​ ​Glang​.​REPLY​ ​,​ ​MessageType​.​text​,​ ​{​ ​quoted​: ​msg​.​data​ ​}​)​; 
 ​} 
  
 ​if​ ​(​message​)​ ​{​  
 ​        ​return​ ​await​ ​msg​.​client​.​sendMessage​(​msg​.​jid​,​ ​Glang​.​NOT​ ​,​ ​MessageType​.​text​,​ ​{​ ​quoted​: ​msg​.​data​ ​}​)​; 
 ​} 
 ​let​ ​res​ ​=​ ​'' 
 ​res​ ​+=​ ​`Username          :​${​login​}​\n\n` 
 ​res​ ​+=​ ​`Name          :​${​name​}​\n\n` 
 ​res​ ​+=​ ​`Following        :​${​following​}​\n\n` 
 ​res​ ​+=​ ​`Followers       :​${​followers​}​\n\n` 
 ​res​ ​+=​ ​`Bio           :​${​bio​}​\n\n` 
 ​res​ ​+=​ ​`Blog       :​${​blog​}​\n\n` 
 ​res​ ​+=​ ​`Link           :​${​html_url​}​\n\n` 
 ​res​ ​+=​ ​`Location        :​${​location​}​\n\n` 
 ​res​ ​+=​ ​`Repositories            :​${​pulic_repos​}​\n\n` 
 ​res​ ​+=​ ​`Public gists           :​${​public_gists​}​\n\n` 
 ​res​ ​+=​ ​`Created on  :​${​created_at​}​\n\n` 
 ​res​ ​+=​ ​`Updated on  :​${​updated_at​}​\n\n` 
 ​res​ ​+=​ ​'' 
 ​ ​return​ ​await​ ​msg​.​client​.​sendMessage​(​msg​.​jid​,​ ​res​,​ ​MessageType​.​text​,​ ​{​ ​quoted​: ​msg​.​data​ ​}​)​; 
 ​}​)​; 
 ​    ​kichu​.​addCommand​(​{​pattern​: ​'lyric ?(.*)'​,​ ​fromMe​: ​false​,​ ​desc​: ​Slang​.​LY_DESC​ ​}​,​ ​(​async​ ​(​message​,​ ​match​)​ ​=>​ ​{ 
  
 ​        ​if​ ​(​match​[​1​]​ ​===​ ​''​)​ ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​ ​Slang​.​NEED​,​ ​MessageType​.​text​)​; 
  
 ​        ​var​ ​aut​ ​=​ ​await​ ​solenolyrics​.​requestLyricsFor​(​`​${​match​[​1​]​}​`​)​;​  
 ​        ​var​ ​son​ ​=​ ​await​ ​solenolyrics​.​requestAuthorFor​(​`​${​match​[​1​]​}​`​)​; 
 ​        ​var​ ​cov​ ​=​ ​await​ ​solenolyrics​.​requestIconFor​(​`​${​match​[​1​]​}​`​)​; 
 ​        ​var​ ​tit​ ​=​ ​await​ ​solenolyrics​.​requestTitleFor​(​`​${​match​[​1​]​}​`​)​; 
  
 ​        ​var​ ​buffer​ ​=​ ​await​ ​axios​.​get​(​cov​,​ ​{​responseType​: ​'arraybuffer'​}​)​; 
  
 ​        ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​ ​Buffer​.​from​(​buffer​.​data​)​,​  ​MessageType​.​image​,​ ​{​caption​: ​`*​${​Slang​.​ARAT​}​* `​ ​+​ ​'```'​ ​+​ ​`​${​match​[​1​]​}​`​ ​+​ ​'```'​ ​+​ ​`\n*​${​Slang​.​BUL​}​* `​ ​+​ ​'```'​ ​+​ ​tit​ ​+​ ​'```'​ ​+​ ​`\n*​${​Slang​.​AUT​}​* `​ ​+​ ​'```'​ ​+​ ​son​ ​+​ ​'```'​ ​+​ ​`\n*​${​Slang​.​SLY​}​*\n\n`​ ​+​ ​aut​ ​}​)​; 
  
 ​    ​}​)​)​; 
 ​    ​kichu.​addCommand​(​{​pattern​: ​'compliment ?(.*)'​,​ ​fromMe​: ​false,​ ​desc​: ​Lang​.​CM_DESC​}​,​ ​async​ ​(​message​,​ ​match​)​ ​=>​ ​{ 
 ​        ​if​ ​(​match​[​1​]​ ​===​ ​'xx'​)​ ​return​ ​await​ ​message​.​reply​(​Lang​.​NEED_LOCATIONA​)​; 
 ​        ​const​ ​url​ ​=​ ​`https://complimentr.com/api`​; 
 ​        ​try​ ​{ 
 ​                ​const​ ​response​ ​=​ ​await​ ​got​(​url​)​; 
 ​                ​const​ ​json​ ​=​ ​JSON​.​parse​(​response​.​body​)​; 
 ​                ​if​ ​(​response​.​statusCode​ ​===​ ​200​)​ ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​ ​'\n\n *compliment : 🤗 '​ ​+​ ​Lang​.​CM​ ​+​'* ```'​ ​+​ ​json​.​compliment​ ​+​ ​'```\n\n'​ ​,​ ​MessageType​.​text​)​; 
 ​        ​}​ ​catch​ ​{ 
 ​                ​return​ ​await​ ​message​.​client​.​sendMessage​(​message​.​jid​,​ ​Lang​.​NOT_FOUNDAC​,​ ​MessageType​.​text​)​; 
 ​        ​} 
 ​}​)​; 
  
  
 ​    ​kichu.​addCommand​(​{​pattern​: ​"covid ?(.*)"​,​ ​fromMe​: ​false,​ ​desc​: ​Clang​.​COV_DESC​}​,​ ​(​async​ ​(​message​,​ ​match​)​ ​=>​ ​{ 
 ​        ​if​ ​(​match​[​1​]​ ​===​ ​""​)​ ​{ 
 ​            ​try​{ 
 ​                ​//const resp = await fetch("https://coronavirus-19-api.herokuapp.com/all").then(r => r.json()); 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/all"​)​.​then​(​async​ ​ok​ ​=>​ ​{ 
 ​                    ​const​ ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🌍 *World-Wide Results:*\n🌐 *Total Cases:* ​${​resp​.​cases​}​\n☠️ *Total Deaths:* ​${​resp​.​deaths​}​\n⚕️ *Total Recovered:* ​${​resp​.​recovered​}​`​)​; 
 ​  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error :\n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
  
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"tr"​ ​||​ ​match​[​1​]​ ​===​ ​"Tr"​ ​||​ ​match​[​1​]​ ​===​ ​"TR"​ ​||​ ​match​[​1​]​.​includes​(​'turkiye'​)​ ​||​ ​match​[​1​]​.​includes​(​'türkiye'​)​ ​||​ ​match​[​1​]​.​includes​(​'türk'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/Turkey"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇹🇷 *Türkiye İçin Sonuçlar:*\n😷 *Toplam Vaka:* ​${​resp​.​cases​}​\n🏥 *Günlük Hasta:* ​${​resp​.​todayCases​}​\n⚰️ *Toplam Ölü:* ​${​resp​.​deaths​}​\n☠️ *Günlük Ölü:* ​${​resp​.​todayDeaths​}​\n💊 *Toplam İyileşen:* ​${​resp​.​recovered​}​\n😷 *Aktif Vaka:* ​${​resp​.​active​}​\n🆘 *Ağır Hasta:* ​${​resp​.​critical​}​\n🧪 *Toplam Test:* ​${​resp​.​totalTests​}​`​)​; 
 ​                ​}​)​; 
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Bir Hata Oluştu, İşte Hata : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
  
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"usa"​ ​||​ ​match​[​1​]​ ​===​ ​"Usa"​ ​||​ ​match​[​1​]​ ​===​ ​"USA"​ ​||​ ​match​[​1​]​ ​===​ ​"america"​ ​||​ ​match​[​1​]​ ​===​ ​"America"​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/USA"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇺🇲 *Datas for USA:*\n😷 *Total Cases:* ​${​resp​.​cases​}​\n🏥 *Daily Cases:* ​${​resp​.​todayCases​}​\n⚰️ *Total Deaths:* ​${​resp​.​deaths​}​\n☠️ *Daily Deaths:* ​${​resp​.​todayDeaths​}​\n💊 *Total Recovered:* ​${​resp​.​recovered​}​\n😷 *Active Cases:* ​${​resp​.​active​}​\n🆘 *Critical Cases:* ​${​resp​.​critical​}​\n🧪 *Total Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"de"​ ​||​ ​match​[​1​]​ ​===​ ​"De"​ ​||​ ​match​[​1​]​ ​===​ ​"DE"​ ​||​ ​match​[​1​]​ ​===​ ​"Germany"​ ​||​ ​match​[​1​]​ ​===​ ​"germany"​ ​||​ ​match​[​1​]​.​includes​(​'deutschland'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/Germany"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇩🇪 *Daten für Deutschland:*\n😷 *Fälle İnsgesamt:* ​${​resp​.​cases​}​\n🏥 *Tägliche Fälle:* ​${​resp​.​todayCases​}​\n⚰️ *Totale Todesfälle:* ​${​resp​.​deaths​}​\n☠️ *Tägliche Todesfälle:* ​${​resp​.​todayDeaths​}​\n💊 *Insgesamt Wiederhergestellt:* ​${​resp​.​recovered​}​\n😷 *Aktuelle Fälle:* ​${​resp​.​active​}​\n🆘 *Kritische Fälle:* ​${​resp​.​critical​}​\n🧪 *Gesamttests:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"az"​ ​||​ ​match​[​1​]​ ​===​ ​"AZ"​ ​||​ ​match​[​1​]​ ​===​ ​"Az"​ ​||​ ​match​[​1​]​.​includes​(​'azerbaycan'​)​ ​||​ ​match​[​1​]​.​includes​(​'azeri'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/Azerbaijan"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇦🇿 *Azərbaycan üçün məlumatlar:*\n😷 *Ümumi Baş Tutan Hadisə:* ​${​resp​.​cases​}​\n🏥 *Günlük Xəstə:* ​${​resp​.​todayCases​}​\n⚰️ *Ümumi Ölüm:* ​${​resp​.​deaths​}​\n☠️ *Günlük Ölüm:* ​${​resp​.​todayDeaths​}​\n💊 *Ümumi Sağalma:* ​${​resp​.​recovered​}​\n😷 *Aktiv Xəstə Sayı:* ​${​resp​.​active​}​\n🆘 *Ağır Xəstə Sayı:* ​${​resp​.​critical​}​\n🧪 *Ümumi Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"uk"​ ​||​ ​match​[​1​]​ ​===​ ​"Uk"​ ​||​ ​match​[​1​]​ ​===​ ​"UK"​ ​||​ ​match​[​1​]​ ​===​ ​"United"​ ​||​ ​match​[​1​]​.​includes​(​'kingdom'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/UK"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇬🇧 *Datas for UK:*\n😷 *Total Cases:* ​${​resp​.​cases​}​\n🏥 *Daily Cases:* ​${​resp​.​todayCases​}​\n⚰️ *Total Deaths:* ​${​resp​.​deaths​}​\n☠️ *Daily Deaths:* ​${​resp​.​todayDeaths​}​\n💊 *Total Recovered:* ​${​resp​.​recovered​}​\n😷 *Active Cases:* ​${​resp​.​active​}​\n🆘 *Critical Cases:* ​${​resp​.​critical​}​\n🧪 *Total Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"in"​ ​||​ ​match​[​1​]​ ​===​ ​"ın"​ ​||​ ​match​[​1​]​ ​===​ ​"In"​ ​||​ ​match​[​1​]​ ​===​ ​"İn"​ ​||​ ​match​[​1​]​ ​===​ ​"İN"​ ​||​  ​match​[​1​]​ ​===​ ​"IN"​ ​||​ ​match​[​1​]​ ​===​ ​"india"​ ​||​ ​match​[​1​]​ ​===​ ​"India"​ ​||​ ​match​[​1​]​.​includes​(​'indian'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/India"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇮🇳 *भारत के लिए डेटा:*\n😷 *कुल मामले:* ​${​resp​.​cases​}​\n🏥 *दैनिक मामले:* ​${​resp​.​todayCases​}​\n⚰️ *कुल मौतें:* ​${​resp​.​deaths​}​\n☠️ *रोज की मौत:* ​${​resp​.​todayDeaths​}​\n💊 *कुल बरामद:* ​${​resp​.​recovered​}​\n😷 *एक्टिव केस:* ​${​resp​.​active​}​\n🆘 *गंभीर मामले:* ​${​resp​.​critical​}​\n🧪 *कुल टेस्ट:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"cn"​ ​||​ ​match​[​1​]​ ​===​ ​"Cn"​ ​||​ ​match​[​1​]​ ​===​ ​"CN"​ ​||​ ​match​[​1​]​.​includes​(​'china'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/China"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇨🇳 *Datas for China:*\n😷 *Total Cases:* ​${​resp​.​cases​}​\n🏥 *Daily Cases:* ​${​resp​.​todayCases​}​\n⚰️ *Total Deaths:* ​${​resp​.​deaths​}​\n☠️ *Daily Deaths:* ​${​resp​.​todayDeaths​}​\n💊 *Total Recovered:* ​${​resp​.​recovered​}​\n😷 *Active Cases:* ​${​resp​.​active​}​\n🆘 *Critical Cases:* ​${​resp​.​critical​}​\n🧪 *Total Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"gr"​ ​||​ ​match​[​1​]​ ​===​ ​"Gr"​ ​||​ ​match​[​1​]​ ​===​ ​"GR"​ ​||​ ​match​[​1​]​.​includes​(​'greek'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/Greece"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇬🇷 *Datas for Greece:*\n😷 *Total Cases:* ​${​resp​.​cases​}​\n🏥 *Daily Cases:* ​${​resp​.​todayCases​}​\n⚰️ *Total Deaths:* ​${​resp​.​deaths​}​\n☠️ *Daily Deaths:* ​${​resp​.​todayDeaths​}​\n💊 *Total Recovered:* ​${​resp​.​recovered​}​\n😷 *Active Cases:* ​${​resp​.​active​}​\n🆘 *Critical Cases:* ​${​resp​.​critical​}​\n🧪 *Total Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"fr"​ ​||​ ​match​[​1​]​ ​===​ ​"Fr"​ ​||​ ​match​[​1​]​ ​===​ ​"FR"​ ​||​ ​match​[​1​]​.​includes​(​'france'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/France"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇫🇷 *Datas for France:*\n😷 *Total Cases:* ​${​resp​.​cases​}​\n🏥 *Daily Cases:* ​${​resp​.​todayCases​}​\n⚰️ *Total Deaths:* ​${​resp​.​deaths​}​\n☠️ *Daily Deaths:* ​${​resp​.​todayDeaths​}​\n💊 *Total Recovered:* ​${​resp​.​recovered​}​\n😷 *Active Cases:* ​${​resp​.​active​}​\n🆘 *Critical Cases:* ​${​resp​.​critical​}​\n🧪 *Total Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"jp"​ ​||​ ​match​[​1​]​ ​===​ ​"Jp"​ ​||​ ​match​[​1​]​ ​===​ ​"JP"​ ​||​ ​match​[​1​]​.​includes​(​'japan'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/Japan"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇯🇵 *Datas for Japan:*\n😷 *Total Cases:* ​${​resp​.​cases​}​\n🏥 *Daily Cases:* ​${​resp​.​todayCases​}​\n⚰️ *Total Deaths:* ​${​resp​.​deaths​}​\n☠️ *Daily Deaths:* ​${​resp​.​todayDeaths​}​\n💊 *Total Recovered:* ​${​resp​.​recovered​}​\n😷 *Active Cases:* ​${​resp​.​active​}​\n🆘 *Critical Cases:* ​${​resp​.​critical​}​\n🧪 *Total Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
 ​  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"kz"​ ​||​ ​match​[​1​]​ ​===​ ​"Kz"​ ​||​ ​match​[​1​]​ ​===​ ​"KZ"​ ​||​ ​match​[​1​]​.​includes​(​'kazakistan'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/Kazakhstan"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇰🇿 *Datas for Kazakhstan:*\n😷 *Total Cases:* ​${​resp​.​cases​}​\n🏥 *Daily Cases:* ​${​resp​.​todayCases​}​\n⚰️ *Total Deaths:* ​${​resp​.​deaths​}​\n☠️ *Daily Deaths:* ​${​resp​.​todayDeaths​}​\n💊 *Total Recovered:* ​${​resp​.​recovered​}​\n😷 *Active Cases:* ​${​resp​.​active​}​\n🆘 *Critical Cases:* ​${​resp​.​critical​}​\n🧪 *Total Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​} 
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"pk"​ ​||​ ​match​[​1​]​ ​===​ ​"Pk"​ ​||​ ​match​[​1​]​ ​===​ ​"PK"​ ​||​ ​match​[​1​]​.​includes​(​'pakistan'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/Pakistan"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇵🇰 *Datas for Pakistan:*\n😷 *Total Cases:* ​${​resp​.​cases​}​\n🏥 *Daily Cases:* ​${​resp​.​todayCases​}​\n⚰️ *Total Deaths:* ​${​resp​.​deaths​}​\n☠️ *Daily Deaths:* ​${​resp​.​todayDeaths​}​\n💊 *Total Recovered:* ​${​resp​.​recovered​}​\n😷 *Active Cases:* ​${​resp​.​active​}​\n🆘 *Critical Cases:* ​${​resp​.​critical​}​\n🧪 *Total Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​}​  
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"ru"​ ​||​ ​match​[​1​]​ ​===​ ​"Ru"​ ​||​ ​match​[​1​]​ ​===​ ​"RU"​ ​||​ ​match​[​1​]​.​includes​(​'russia'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/Russia"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇷🇺 *Datas for Russia:*\n😷 *Total Cases:* ​${​resp​.​cases​}​\n🏥 *Daily Cases:* ​${​resp​.​todayCases​}​\n⚰️ *Total Deaths:* ​${​resp​.​deaths​}​\n☠️ *Daily Deaths:* ​${​resp​.​todayDeaths​}​\n💊 *Total Recovered:* ​${​resp​.​recovered​}​\n😷 *Active Cases:* ​${​resp​.​active​}​\n🆘 *Critical Cases:* ​${​resp​.​critical​}​\n🧪 *Total Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​}​  
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"id"​ ​||​ ​match​[​1​]​ ​===​ ​"İd"​ ​||​ ​match​[​1​]​ ​===​ ​"İD"​ ​||​ ​match​[​1​]​ ​===​ ​"ıd"​ ​||​ ​match​[​1​]​ ​===​ ​"Id"​ ​||​ ​match​[​1​]​ ​===​ ​"ID"​ ​||​ ​match​[​1​]​.​includes​(​'ındonesia'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/Indonesia"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇮🇩 *Datas for Indonesia:*\n😷 *Total Cases:* ​${​resp​.​cases​}​\n🏥 *Daily Cases:* ​${​resp​.​todayCases​}​\n⚰️ *Total Deaths:* ​${​resp​.​deaths​}​\n☠️ *Daily Deaths:* ​${​resp​.​todayDeaths​}​\n💊 *Total Recovered:* ​${​resp​.​recovered​}​\n😷 *Active Cases:* ​${​resp​.​active​}​\n🆘 *Critical Cases:* ​${​resp​.​critical​}​\n🧪 *Total Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​}​  
 ​        ​else​ ​if​ ​(​match​[​1​]​ ​===​ ​"nl"​ ​||​ ​match​[​1​]​ ​===​ ​"Nl"​ ​||​ ​match​[​1​]​ ​===​ ​"NL"​ ​||​ ​match​[​1​]​.​includes​(​'netherland'​)​ ​)​ ​{ 
 ​            ​try​{ 
 ​                ​const​ ​respo​ ​=​ ​await​ ​got​(​"https://coronavirus-19-api.herokuapp.com/countries/Netherlands"​)​.​then​(​async​ ​ok​  ​=>​ ​{ 
 ​                    ​resp​ ​=​ ​JSON​.​parse​(​ok​.​body​)​; 
 ​                    ​await​ ​message​.​reply​(​`🇳🇱 *Datas for Netherlands:*\n😷 *Total Cases:* ​${​resp​.​cases​}​\n🏥 *Daily Cases:* ​${​resp​.​todayCases​}​\n⚰️ *Total Deaths:* ​${​resp​.​deaths​}​\n☠️ *Daily Deaths:* ​${​resp​.​todayDeaths​}​\n💊 *Total Recovered:* ​${​resp​.​recovered​}​\n😷 *Active Cases:* ​${​resp​.​active​}​\n🆘 *Critical Cases:* ​${​resp​.​critical​}​\n🧪 *Total Test:* ​${​resp​.​totalTests​}​`​)​; 
  
 ​                ​}​)​; 
  
 ​            ​}​ ​catch​ ​(​err​)​ ​{ 
 ​                ​await​ ​message​.​reply​(​`Error : \n​${​err​.​message​}​`​,​ ​MessageType​.​text​) 
 ​            ​} 
 ​        ​}​  
 ​        ​else​ ​{ 
 ​            ​return​ ​await​ ​message​.​client​.​sendMessage​( 
 ​                ​message​.​jid​, 
 ​                ​Clang​.​NOT​, 
 ​                ​MessageType​.​text 
 ​            ​)​; 
 ​        ​} 
 ​    ​}​)​)​;
